export const uk = {
  translation: {
    city: {
        kamyanske: "Кам’янське",
        kryvyi_rih: "Кривий Ріг",
    },

    common: {
      close: "Закрити",
      cancel: "Скасувати",
      back: "Назад",
    },

    nav: {
      map: "Мапа",
      aboutProject: "Про проєкт",
      aboutNpl: "Про NeboPole.Labs",
    },

    popup: {
      status: "Статус",
      type: "Тип",
      date: "Дата",
      shortDescription: "Короткий опис",
      decision: "Рішення",
    },

    excursion: {
        title: "Пройти екскурсію",

        selectHint: "Клікайте по обʼєктах на мапі, щоб додати їх до списку.",
        inactiveHint: "Увімкніть добір, щоб додавати обʼєкти до екскурсії.",

        collapse: "Згорнути",
        clearList: "Очистити список",
        emptyList: "Список порожній. Додайте обʼєкти для маршруту.",
        remove: "Видалити",

        finishSelection: "Завершити добір",
        addObjects: "Додати обʼєкти",

        buildRoute: "Побудувати маршрут",
        chooseStart: "Оберіть початок маршруту",
        geolocation: "Використати геолокацію",
        manual: "Встановити точку вручну",
    },

    legend: {
        title: "Легенда",
        gardenPark: "Пам'ятка садово-паркового мистецтва",
        proposed: "Запропонований об’єкт",
        heritage: "Об’єкт культурної спадщини",
        significant: "Значні історичні будівлі",
        ordinary: "Рядові історичні будівлі",
        urbanPlanning: "Визначний містобудівний ареал",
    },

    startRouteModal: {
        title: "Оберіть старт маршруту",
        manual: "Встановити точку на мапі",
        manualHint: "(Клікніть на мапі)",
        geolocation: "Дозволити геолокацію",
    },

    aboutPage: {
        nav: {
            about: "ОПИС",
            team: "КОМАНДА",
            contributors: "КОНТРИБ'ЮТОРИ",
            partners: "ПАРТНЕРИ",
            contacts: "КОНТАКТИ",
        },

        banner: {
            title: "Невидима історія стає видимою",        
        },
        description: {
            introBefore: "Вітаємо👋 на платформі проєкту",
            projectName: "Historical Landscape Remembrance",

            paragraph1:
            "Historical Landscape Remembrance (HLR) — цифровий дослідницький та civic-tech проєкт, спрямований на ідентифікацію, документування та візуалізацію історичних міських ландшафтів і об’єктів культурної спадщини.",

            paragraph2:
            "Проєкт поєднує історичні джерела, просторові дані та цифрові технології, щоб виявляти трансформації міського середовища та робити раніше невидимі шари міської історії доступними.",

            paragraph3:
            "HLR створює інтерактивне просторове середовище, у якому користувачі можуть досліджувати об’єкти спадщини, історичну забудову та містобудівні структури у їхньому географічному та історичному контексті.",
        },

    },
  },
};