export const uk = {
  translation: {
    city: {
        kamyanske: "Кам’янське",
        kryvyi_rih: "Кривий Ріг",
    },

    common: {
      close: "Закрити",
      cancel: "Скасувати",
      back: "Назад",
    },

    nav: {
      map: "Мапа",
      aboutProject: "Про проєкт",
      aboutNpl: "Про NeboPole.Labs",
    },

    popup: {
      status: "Статус",
      type: "Тип",
      date: "Дата",
      shortDescription: "Короткий опис",
      decision: "Рішення",
    },

    excursion: {
        title: "Пройти екскурсію",

        selectHint: "Клікайте по обʼєктах на мапі, щоб додати їх до списку.",
        inactiveHint: "Увімкніть добір, щоб додавати обʼєкти до екскурсії.",

        collapse: "Згорнути",
        clearList: "Очистити список",
        emptyList: "Список порожній. Додайте обʼєкти для маршруту.",
        remove: "Видалити",

        finishSelection: "Завершити добір",
        addObjects: "Додати обʼєкти",

        buildRoute: "Побудувати маршрут",
        chooseStart: "Оберіть початок маршруту",
        geolocation: "Використати геолокацію",
        manual: "Встановити точку вручну",
    },

    legend: {
        title: "Легенда",
        gardenPark: "Пам'ятка садово-паркового мистецтва",
        proposed: "Запропонований об’єкт",
        heritage: "Об’єкт культурної спадщини",
        significant: "Значні історичні будівлі",
        ordinary: "Рядові історичні будівлі",
        urbanPlanning: "Визначний містобудівний ареал",
    },

    startRouteModal: {
        title: "Оберіть старт маршруту",
        manual: "Встановити точку на мапі",
        manualHint: "(Клікніть на мапі)",
        geolocation: "Дозволити геолокацію",
    },

    aboutPage: {
        nav: {
            about: "ОПИС",
            team: "КОМАНДА",
            contributors: "КОНТРИБ'ЮТОРИ",
            partners: "ПАРТНЕРИ",
            contacts: "КОНТАКТИ",
        },

        banner: {
            title: "Невидима історія стає видимою",        
        },
        description: {
            welcome: "Вітаємо👋",
            introBefore: "на платформі проєкту",
            projectName: "Historical Landscape Remembrance",

            paragraph1:
            "> Historical Landscape Remembrance (HLR) — дослідницький та civic-tech проєкт, спрямований на виявлення, документування та захист історичних міських ландшафтів і об’єктів культурної спадщини, та таких що залишаються поза межами офіційного визнання як культурної спадщини.",

            paragraph2:
            "> Заснований у 2023 році як відповідь на процес втрати та деградації цінних історичних міських ландшафтів в українських містах, проєкт HLR поєднує історичні дослідження, просторові дані, громадську адвокацію та цифрові технології для виявлення невизнаної спадщини, документування її трансформацій та візуалізації раніше невидимих шарів міської історії.",

            paragraph3:
            "> Цифрова платформа HLR перетворює результати цих досліджень на інтерактивне просторове середовище, у якому користувачі можуть досліджувати об’єкти культурної спадщини, історичну забудову та містобудівні структури в їхньому географічному, історичному та законодавчому контексті. Просторова аналітика формує доказову базу для захисту цінних об’єктів та ланшафтів."
        },

        development: {
            title: "#Розвиток проєкту",
            },

        stats: {
            cities: "Пілотні міста",
            objects: "Замаповані об’єкти",
            kryvyiRih: "Кривий Ріг",
            kamianske: "Кам’янське",
            },

    },

    mapDashboard: {
        all: "Усі об’єкти",
        proposed: "Запропоновані",
        proposedHint: "(незахищені)",
        protected: "Культурна спадщина",
        protectedHint: "(захищені)",
    },

    heritageType: {
        architecture: "Архітектури",
        archaeology: "Археології",
        monumentalArt: "Монументального мистецтва",
    },
    filters: {
        all: "Всього",
        byStatus: "За статусом",
        byType: "За типом",
        analytics: "Аналітика",

        analyticsByStatus: "діаграма за статусом",
        analyticsByType: "діаграма за типом",
    },
  },
};